In [1]:
import numpy as np
import pandas as pd

In [24]:

data = {
    'Department': ['IT', 'HR', 'IT', 'Finance', 'HR'],
    'Salary': [80000, 50000, 90000, 70000, 55000],
    'Experience': [5, 3, 7, 2, 4]
}
df2 = pd.DataFrame(data)

In [16]:
grouped = df.groupby('Department')['Salary'].mean()
grouped[grouped>60000]

Department
Finance    70000.0
IT         85000.0
Name: Salary, dtype: float64

In [17]:
df = pd.DataFrame({
    'A': [1, 2, None, 4],
    'B': [None, 2, 3, 4]
})

In [20]:
df['A']=df['A'].fillna(df['A'].mean())

In [21]:
df

          A    B
0  1.000000  NaN
1  2.000000  2.0
2  2.333333  3.0
3  4.000000  4.0

In [22]:
df = df.dropna(subset=['B'])

In [23]:
df

          A    B
1  2.000000  2.0
2  2.333333  3.0
3  4.000000  4.0

In [30]:
df2 = pd.DataFrame({
    'Department': ['IT', 'IT', 'HR', 'HR', 'Finance'],
    'Year': [2020, 2021, 2020, 2021, 2021],
    'Salary': [70000, 75000, 48000, 50000, 60000]
})


pivot = df2.pivot_table(index='Department', columns='Year', values='Salary')
pivot

Year           2020     2021
Department
Finance         NaN  60000.0
HR          48000.0  50000.0
IT          70000.0  75000.0

In [32]:
df2['Year'].corr(df2['Salary'])

np.float64(0.12265669099479325)